# ==========================================
# โจทย์ข้อที่ 4: คำนวณค่าจัดส่งสินค้าตามน้ำหนัก
# Input: น้ำหนักสินค้า kg (จำนวนจริงหรือจำนวนเต็ม)
# Output: ค่าจัดส่ง (30, 50 หรือ 100)
# เงื่อนไข: น้ำหนัก <= 1 kg จ่าย 30 | น้ำหนัก <= 5 kg จ่าย 50 | เกิน 5 kg จ่าย 100
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
weight = float(input("น้ำหนักสินค้า"))
output = int(input("ค่าจัดส่ง (30, 50, 100)"))

if weight <= 1 kg
    print "30"
elif weight <= 5 kg
    print "50"
else weight > 5 kg
    print "100"
